app/controllers/students_controller.rb

SELECT "students".* FROM "students"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @students = Student.all
    @student = Student.find(params[:id])